#Напишите несколько строк кода, выводящих на экран ваше имя и почто-
#вый адрес. Адрес напишите в формате, принятом в вашей стране. Ника-
#кого ввода от пользователя ваша первая программа принимать не будет, 
#только вывод на экран и больше ничего.

print('г. Харьков ул. Днепровская, 1 кв.54')
