#Напишите программу, запрашивающую у пользователя его имя. В ответ 
#на ввод на экране должно появиться приветствие с обращением по имени, 
#введенному с клавиатуры ранее.

name = str(input('Enter your name: '))
print(f'Hello, {name}!')