#Напишите программу, которая будет преобразовывать десятичные зна-
#чения (по основанию 10) в двоичные (по основанию 2).

num = int(input('Enter number: '))

print(bin(num)[2:])
